#ifndef _LIBRARY_H_ /*директива, котора€ защищает
от повторного включени€ заголовочных файлов, чтобы не было переопределени€ одних и тех же функций/классов.*/
#define _LIBRARY_H_

#include <iostream>
#include <cstdint> /*в этом файле определены макросы с указанием верхних и нижних границ представл€емых значений
и макро-функции дл€ формировани€ диапазонов представл€емых значений дл€ каждого типа данных.*/
#include <ctime>
#include <iomanip> /*«адает символ, который будет использоватьс€ дл€ заполнени€ пробелов на экране
с выравниванием по правому краю.*/

#endif // !_LIBRARY_H_
